app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 14]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 12]]
---
<p class="body_article"> <%= @article.body %> </p>
<h3>COMMENTS (<%= @article.comments.size %>)</h3>